---
type: DocumentDifference
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# DocumentDifference

`Autodesk.Revit.DB.DocumentDifference` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCreatedElementIds | 2023 | `public ISet < ElementId > GetCreatedElementIds ()` |
| Method | GetDeletedElementIds | 2023 | `public ISet < ElementId > GetDeletedElementIds ()` |
| Method | GetModifiedElementIds | 2023 | `public ISet < ElementId > GetModifiedElementIds ()` |
| Property | AreDeletedElementIdsAvailable | 2023 | `public bool AreDeletedElementIdsAvailable { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |